In [16]:
import numpy as np
import pandas as pd

# Series TUtorial

In [17]:
labels = ['a', 'b', 'c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [18]:
pd.Series(my_list, index=labels)

a    10
b    20
c    30
dtype: int64

In [19]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [20]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [21]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [22]:
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [23]:
ser1 = pd.Series([1,2,3,4], index=['USA', 'CHINA', 'FRANCE', 'GERMANY'])

In [24]:
ser1

USA        1
CHINA      2
FRANCE     3
GERMANY    4
dtype: int64

In [25]:
ser2 = pd.Series([1,2,3,4], index=['USA', 'CHINA', 'ITALY', 'JAPAN'])

In [26]:
ser2

USA      1
CHINA    2
ITALY    3
JAPAN    4
dtype: int64

In [27]:
ser1['USA']

1

In [28]:
ser2['JAPAN']

4

In [29]:
ser1 + ser2

CHINA      4.0
FRANCE     NaN
GERMANY    NaN
ITALY      NaN
JAPAN      NaN
USA        2.0
dtype: float64

In [85]:
# Dataframe Tutorial
import numpy as pd
import pandas as pd
from numpy.random import randn

In [86]:
np.random.seed(101)

In [87]:
df = pd.DataFrame(randn(5,4),['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

In [88]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [89]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [90]:
type(df['W'])

pandas.core.series.Series

In [91]:
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [98]:
df['new'] = df['W'] + df['Y']

In [100]:
df.drop('new',axis=1,inplace=True)

In [101]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [102]:
df.shape

(5, 4)

In [103]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [104]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [105]:
df.loc['B','Y']

-0.8480769834036315

In [106]:
df.loc[['A', 'B'],['W', 'Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [107]:
# Pandas Dataframes PART 2

In [108]:
import numpy as np
import pandas as pd
from numpy.random import randn
np.random.seed(101)

In [109]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'],['W','X','Y','Z'])

In [110]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [111]:
# Conditional Selection with [] notation

In [113]:
booldf = df > 0

In [114]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [115]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [116]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [117]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [118]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [119]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [120]:
resultdf = df[df['W']>0]

In [122]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [123]:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [124]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [125]:
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [126]:
df['State'] = newind

In [127]:
df

          W         X         Y         Z State
A  2.706850  0.628133  0.907969  0.503826    CA
B  0.651118 -0.319318 -0.848077  0.605965    NY
C -2.018168  0.740122  0.528813 -0.589001    WY
D  0.188695 -0.758872 -0.933237  0.955057    OR
E  0.190794  1.978757  2.605967  0.683509    CO

In [128]:
df.set_index('State')

              W         X         Y         Z
State
CA     2.706850  0.628133  0.907969  0.503826
NY     0.651118 -0.319318 -0.848077  0.605965
WY    -2.018168  0.740122  0.528813 -0.589001
OR     0.188695 -0.758872 -0.933237  0.955057
CO     0.190794  1.978757  2.605967  0.683509

In [129]:
# Panda Dataframe

In [133]:
import numpy as np
import pandas as pd
import pandas_datareader as web
import datetime as dt

In [141]:
banks = pd.read_csv('banklist.csv')

In [143]:
# Show the head of the dataframe

In [144]:
banks.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17

In [145]:
# What are the column names

In [147]:
banks.columns

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

In [148]:
# How many states are represented in this data set?

In [149]:
banks['ST'].nunique()

44

In [150]:
# Get a list of array of all the states in the data set

In [151]:
banks['ST'].unique()

array(['IL', 'WI', 'LA', 'UT', 'NJ', 'AR', 'GA', 'PA', 'TN', 'WA', 'CO',
       'PR', 'FL', 'MN', 'CA', 'MD', 'OK', 'OH', 'SC', 'VA', 'ID', 'TX',
       'CT', 'AZ', 'NV', 'NC', 'KY', 'MO', 'KS', 'AL', 'MI', 'IN', 'IA',
       'NE', 'MS', 'NM', 'OR', 'NY', 'MA', 'SD', 'WY', 'WV', 'NH', 'HI'],
      dtype=object)

In [152]:
# What are the top 5 state wit the most failed banks?

In [153]:
banks.groupby("ST").count()

    Bank Name  City  CERT  Acquiring Institution  Closing Date  Updated Date
ST
AL          7     7     7                      7             7             7
AR          3     3     3                      3             3             3
AZ         16    16    16                     16            16            16
CA         41    41    41                     41            41            41
CO         10    10    10                     10            10            10
CT          2     2     2                      2             2             2
FL         75    75    75                     75            75            75
GA         93    93    93                     93            93            93
HI          1     1     1                      1             1             1
IA          2     2     2                      2             2             2
ID          2     2     2                      2             2             2
IL         67    67    67                     67            67            67
IN          3     3     3                      3             3             3
KS          9     9     9                      9             9             9
KY          2     2     2                      2             2             2
LA          4     4     4                      4             4             4
MA          1     1     1                      1             1             1
MD         10    10    10                     10            10            10
MI         14    14    14                     14            14            14
MN         23    23    23                     23            23            23
MO         16    16    16                     16            16            16
MS          2     2     2                      2             2             2
NC          7     7     7                      7             7             7
NE          3     3     3                      3             3             3
NH          1     1     1                      1             1             1
NJ          7     7     7                      7             7             7
NM          3     3     3                      3             3             3
NV         12    12    12                     12            12            12
NY          5     5     5                      5             5             5
OH          8     8     8                      8             8             8
OK          7     7     7                      7             7             7
OR          6     6     6                      6             6             6
PA         10    10    10                     10            10            10
PR          4     4     4                      4             4             4
SC         10    10    10                     10            10            10
SD          1     1     1                      1             1             1
TN          7     7     7                      7             7             7
TX         12    12    12                     12            12            12
UT          8     8     8                      8             8             8
VA          5     5     5                      5             5             5
WA         19    19    19                     19            19            19
WI         11    11    11                     11            11            11
WV          1     1     1                      1             1             1
WY          1     1     1                      1             1             1

In [154]:
# What are the top 5 state with the most failed banks?

In [155]:
banks.groupby("ST").count().sort_values('Bank Name').tail()

    Bank Name  City  CERT  Acquiring Institution  Closing Date  Updated Date
ST
MN         23    23    23                     23            23            23
CA         41    41    41                     41            41            41
IL         67    67    67                     67            67            67
FL         75    75    75                     75            75            75
GA         93    93    93                     93            93            93

In [158]:
banks.groupby("ST").count().sort_values('Bank Name',ascending=False).iloc[:5]['Bank Name'].tail()

ST
GA    93
FL    75
IL    67
CA    41
MN    23
Name: Bank Name, dtype: int64

In [159]:
# What are the top 5 acquiring institutions?

In [160]:
banks["Acquiring Institution"].value_counts()

No Acquirer                            31
State Bank and Trust Company           12
First-Citizens Bank & Trust Company    11
Ameris Bank                            10
U.S. Bank N.A.                          9
Community & Southern Bank               8
Centennial Bank                         7
Bank of the Ozarks                      7
Stearns Bank, N.A.                      7
MB Financial Bank, N.A.                 6
Central Bank                            6
CenterState Bank of Florida, N.A.       6
Republic Bank of Chicago                6
Premier American Bank, N.A.             5
U.S. Bank, N.A.                         5
Great Southern Bank                     5
Columbia State Bank                     5
CertusBank, National Association        5
Sunwest Bank                            5
IBERIABANK                              4
Simmons First National Bank             4
First Federal Bank of Florida           4
Stonegate Bank                          4
City National Bank                      4
Umpqua Bank                             4
United Bank                             4
Northbrook Bank & Trust Company         4
Hamilton State Bank                     4
First Financial Bank, N.A.              4
United Fidelity Bank, fsb               4
                                       ..
Hancock Bank                            1
Bank of Ann Arbor                       1
The Park Bank                           1
FirstAtlantic Bank                      1
Security Bank                           1
Northern State Bank                     1
Inland Bank & Trust                     1
People's United Bank                    1
The Savannah Bank, N.A.                 1
Bank Leumi USA                          1
Center Bank                             1
The PrivateBank and Trust Company       1
Southern States Bank                    1
Bank of Upson                           1
Bank of Marin                           1
Providence Bank, LLC                    1
Morton Community Bank                   1
Peoples Bank of East Tennessee          1
Royal Bank                              1
Southern New Hampshire Bank & Trust     1
BBVA Compass                            1
TIB Bank                                1
First Community Bank                    1
American First National Bank            1
United Community Bank                   1
Bank of Southern California, N.A.       1
Union State Bank                        1
Bay Cities Bank                         1
Banterra Bank of Marion                 1
Crown Bank                              1
Name: Acquiring Institution, Length: 286, dtype: int64

In [161]:
# How many banks has the state Bank of Texas acquired? How many of them were acutally in Texas?

In [164]:
banks[banks["Acquiring Institution"] == 'State Bank of Texas']

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17
21,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,24-Oct-14,6-Jan-16
450,Millennium State Bank of Texas,Dallas,TX,57667,State Bank of Texas,2-Jul-09,26-Oct-12

In [165]:
# What is the most common city in CA for bank to fail in?

In [169]:
banks[banks['ST']=='CA'].groupby('City').count().sort_values('Bank Name',ascending=False).head(1)

,Bank Name,ST,CERT,Acquiring Institution,Closing Date,Updated Date
City,,,,,,
Los Angeles,4,4,4,4,4,4

In [170]:
# How many failed banks dont have the word Bank in their name?

In [172]:
sum(banks['Bank Name'].apply(lambda name: 'Bank' not in name))

14

In [175]:
sum(banks['Bank Name'].apply(lambda name: name[0].upper() == 'S'))

53

In [177]:
sum(banks['CERT'] > 20000)

417

In [178]:
# How many banks names consist of just two words?

In [180]:
sum(banks['Bank Name'].apply(lambda name: len(name.split())==2))

114

In [181]:
banks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 551 entries, 0 to 550
Data columns (total 7 columns):
Bank Name                551 non-null object
City                     551 non-null object
ST                       551 non-null object
CERT                     551 non-null int64
Acquiring Institution    551 non-null object
Closing Date             551 non-null object
Updated Date             551 non-null object
dtypes: int64(1), object(6)
memory usage: 30.2+ KB

In [184]:
sum(banks['Closing Date'].apply(lambda date: date[-2:] == '08'))

25

In [187]:
sum(pd.to_datetime(banks['Closing Date']).apply(lambda date: date.year == 2008))

25